[
  {
    "title": "Alfa Animation Club",
    "description": "Mission: Alfa Animation club is designed to make people of all ethnicity \nand gender feel welcomed and valued. It is especially made for those who \nlove animation. If you enjoy cartoons, animated films, graphic design then \nthis is the club for you! Expand your connections with likeminded people, \nenjoy free snacks and music along with animation viewing and games. Afla \nAnimation club, it's the most animated club on campus! \n\nPresident: Michael Gordon  \n\nmgordon341@student.glendale.edu \n\nVice President: Andrew Blocher  \n\nabloche406@student.glendale.edu \n\nClub Advisor: John Zacrone  \n\njzarcone@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1696530040028-WNRDBPFF1C93HDW04UTL/Screen+Shot+2023-09-21+at+12.01.47+PM.png"
  },
  {
    "title": "Alpha Gamma Sigma Honors Society",
    "description": "Mission: The purpose of the organization shall be to foster, promote, \nmaintain, and recognize scholarship. The function of the local chapters \nshall be to develop, in themselves, or in cooperation with other chapters, \nprograms offering cultural, social or enrichment experiences as a part of \nthe total experience of community college students. The local chapters \nshall also provide opportunities for participation in service activities by \ntheir members.\n\nPresident: Aren Adamian\n\naadamia592@student.glendale.edu\n\nVice President: Dino Azadians\n\ndazadia831@student.glendale.edu  \n\nAdvisor: Isaac Pedraza\n\nipedraza@glendale.edu\n\nMeeting Date & Time: Bi-Weekly, Mondays 1:00pm-2:00pm\n\nInstagram: @gccalphagammasigma\n\nLinktree: https://linktr.ee/GCCAlphaGammaSigma",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1632948659975-EOAO1P01VTI3WA4ZW4CE/torch_highres.fw.jpg"
  },
  {
    "title": "A.I Frontier Explorers",
    "description": "Mission Statement: The A. I Frontier Explorers is a club where we discover \naspects of Artificial Intelligence, like learning prompt engineering to \nkeep up with A. I news, and how we integrate this technology into our daily \nlives. Artificial intelligence has become the most important technological \nadvancement in the past few years; we must adapt and be ready. That is the \naim of this club, is to shed light on this technology and do our best to \nunderstand it.\n\nPresident: Emilio Guillen\n\neguille953@student.glendale.edu\n\nVice President: Pending\n\nAdvisor: Edwin Sookiassian\n\nesookiassian@glendale.edu",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1709835375639-PPUB384H569LVP8CRB0V/a.i_club_logo_original+%281%29.jpg"
  },
  {
    "title": "Beacon Bible Talk",
    "description": "Mission Statement: Our mission at Beacon Bible Talk is to shine as a beacon \nof light by promoting and embodying biblical principles. We are dedicated \nto cultivating a vibrant community of Christians, providing a welcoming \nspace for fellowship, encouragement, and spiritual growth. Through our \nactions and relationships, we strive to reflect the love of Christ and \npositively impact the lives of those around us.\n\nPresident: Jarren Flower \n\nJflower518@student.glendale32.edu \n\nVice President: Ashton Parsons  \n\napar9355@gmail.com\n\nClub Advisor: Ernest Baker \n\nebaker@glendale.edu "
  },
  {
    "title": "Armenian Pre-Health Society",
    "description": "Mission: Our mission is to promote the understanding of how the pre-health \nroute for students works by giving students access to healthcare \nprofessionals that can guide students and provide reliable advice for \npre-health routes. We encourage student involvement and promote service \nactivities within said community without discrimination. Our purpose is to \nact as a medium for the members in pre-health objectives.\n\nPresident: Lori Avakian\n\nlavakia720@student.glendale.edu\n\nVice President: Sarah Shahbandaryan\n\nsshahba482@student.glendale.edu\n\nAdvisor: Gagik Labadzhyan\n\nglabadzh@glendale.edu\n\nMeeting Date & Time: To be decided",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1651638017564-92WJMF4L7DD9V9JOVH4V/IMG_5797.PNG"
  },
  {
    "title": "Armenian Politics Club",
    "description": "Mission: Our club's goal is to discuss the decisions made by the Armenian \ngovernment as well as neighboring nations. We stand for the free and open \ndebate of ideas and opinions that revolve around the Armenian's \ngovernment's decisions. The true goal of our club is to further expand the \nmembers knowledge of politics and Armenian politics as well as to point \nattention to what decisions are being made for Armenia to the students of \nGCC.\n\nPresident: Gevork Mavoyan \n\ngmavoya544@student.glendale.edu \n\nVice President: Harout Amirkhanian \n\nHamirkh543@student.glendale.edu \n\nClub Advisor: Daniel Kono \n\ndkono@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1696530501016-KV438TKHK9KIYLAX2XZM/armenian+politics+club+%281%29.png"
  },
  {
    "title": "Armenian Student Association",
    "description": "Mission: The Glendale Community College Armenian Student Association (GCC \nASA) is committed to preserving and celebrating Armenian culture while \nfostering cross-cultural understanding within our diverse academic \ncommunity. Our mission is to provide an inclusive space for Armenian \nstudents and peers to explore, appreciate, and engage with Armenian \nculture, history, and contemporary issues through non-partisan, open \ndiscourse. We curate engaging social, cultural, and educational activities \nto enrich academic experiences and contribute positively to our community, \nupholding democratic principles, financial transparency, and \naccountability. Our vision is to empower the next generation to connect \nwith their Armenian heritage and be proactive global citizens. This \nConstitution was adopted and ratified by the Armenian Student Association \nat Glendale Community College. \n\nPresident: Amaras Issagholian\n\nAissagh885@student.glendale.edu\n\nVice President: Ani Isaiants\n\nAisaian956@student.glendale.edu\n\nAdvisor: Gagik Labadzhyan\n\nglabadzh@glendale.edu\n\nMeeting Date & Time: TBA\n\nInstagram: @asagcc",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1677544377136-2MEE2QSNRO7CJ9LDP03G/Screenshot+2023-02-27+163248.png"
  },
  {
    "title": "Autonomous Vehicles GCC",
    "description": "Mission: To enable student access to and experimentation with \nindustry-level autonomous systems. \n\nPresident: Hunter Pruett \n\nhunterpruett2003@gmail.com \n\nVice President: Karen Mkrtchyan  \n\nkmkrtch754@student.glendale.edu\n\nAdvisor: Mark Bowen  \n\nmbowen@glendale.edu\n\nMeeting Date & Time:\n\nLocation: Sandbox SR 321",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1678403992221-9C5YJIBPS120565V8NMB/app_sticker_avgccTextOnly.png"
  },
  {
    "title": "Biology Journal Club",
    "description": "Mission Statement: We aim to inspire curiosity and to build skills that \nwill be essential to succeed in any research endeavors.\n\nPresident: Michael Chhan \n\nmchhan403@student.glendale.edu \n\nVice President: Liliya Stepanyan \n\nlstepan044@student.glendale.edu \n\nClub Advisor: Shelley Thai \n\nSthai@glendale.edu "
  },
  {
    "title": "Black Student Union",
    "description": "Mission: The Black Student Union strives to provide a safe space for \nBlack/African American students to unite, have a voice, and discuss \nculturally relevant experiences to create a sense of belonging, community, \npresence and empowerment on the GCC campus. Additionally, we seek to \nprovide a platform of resources and leadership experiences for \nBlack/African American students and share our rich culture with the GCC \ncommunity. We also offer support for the various racialized \nmacro-and-microaggressions, and challenge each other toward centering the \nliberation of ALL Black/African American people. Our motto is celebrating \nBlack Excellence!\n\nPresident: Trinity Sneed\n\ntsneed568@student.glendale.edu\n\nVice President: Billie Brooks\n\nbbrooks283@student.glendale.edu  \n\nAdvisor: Alexandra Evans\n\nalexandrae@glendale.edu\n\nMeeting Date & Time: Mondays at 11am ( Once a month)\n\nSeptember 25, October 23, November 13, December 4th.\n\nInstagram: @bsu_glendale",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1663047235994-VUMSC7WFN60R5S3FWNVL/logo.jpg"
  },
  {
    "title": "Book Club",
    "description": "Mission Statement: The purpose of the club is to provide a community for \nall book lovers to engage and share insights on their knowledge of the \nreadings. We hope to enhance the reading experience by exploring different \ngenres and supporting the members of the club through different events and \ndiscussions. \n\nPresident: Elena Sargsyan\n\nesargsy097@student.glendale.edu\n\nVice President: Natali Ghanbari\n\nnghanba337@student.glendale.edu\n\nAdvisor: Heather Ramos\n\nhramos@glendale.edu\n\nMeeting Date & Time: Fridays from 3pm-4pm. (Bi-weekly)\n\nInstagram: bookclub_gcc\n\n",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694710989506-VC327TKQFS1H3WG3ZT9K/Image030.jpeg"
  },
  {
    "title": "BUSINESS CLUB",
    "description": "Mission: As the first and longest-standing collegiate chapter of Business \nClub, among several universities such as USC and UCLA, we serve as a \nprofessional networking community, aiming to unite today’s developed \nprofessionals with those of the future. We are an open door to people and \nstudents of all majors, backgrounds, and goals. Business Club creates a \nspace on campus for every student to leverage their best qualities. We \nprove that any student can acquire a business mindset. We offer a range of \nunique experiences and events each semester, knowing that college is a time \nfor discovery and growth, but most importantly, a time that sets a crucial \nfoundation for the future. We have a strong network composed of individuals \nthat can link our members to job opportunities, internships, and new \nexperiences that inspire our highest pillars of innovation, leadership, \nnetworking, and dedication. Join us! Business is for everyone - no matter \nthe major.\n\nPresident: Hunter Pruett\n\nhpruett529@student.glendale.edu\n\nVice President: Esfar Jawad\n\nejawad592@student.glendale.edu\n\nAdvisor: Sophia Possidon\n\nspossidon@glendale.edu\n\nMeeting Date & Time: Once a month- to be announced\n\nInstagram: @businessgcc",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1663797721829-BORHXI6TY3V0U2KYSKX5/a0c08fd975654efab6173476fb292659.jpg"
  },
  {
    "title": "Community Impact Club",
    "description": "Mission Statement: The “Community Impact Club” is a service-learning \norganization focused on combining community service with learning \nexperiences. We will engage in activities that help improve our community \nas well as allow ourselves to gain new educational opportunities. We are \nhere to roll up our sleeves and take action in our community, with an \nimportant emphasis on educating ourselves in the process. We aspire to \nempower and uplift the people in our society and contribute to the \nbetterment of the community, all while learning something new. \n\nPresident: Janet Paylevanyan  \n\njpaylevan@gmail.com \n\nVice President: Emily Torikian  \n\nemilytorikian@gmail.com \n\nClub Advisor: Steve Bie  \n\nsbie@gmail.com "
  },
  {
    "title": "Computer Science Club",
    "description": "Mission: This is a club for people who are interested in joining GCC's \nComputer Science community. Our main goal is to create an environment for \nCS majors as well as people who want to gain experience in this field to \nfind connections and friends who can potentially help each other in \ncreating projects, getting internships, and exchanging knowledge. \nBasically, we will help students with job opportunities and create a strong \npotential to get into desired schools. \n\nPresident: Mykhailo Hrabynskyi\n\nmhrabyn774@student.glendale.edu\n\nVice President: Arin Boyadjian\n\naboyadj259@student.glendale.edu\n\nAdvisor: Edwin Sookiassian\n\nesookiassian@glendale.edu\n\nMeeting Date & Time: Wednesdays at 12:00pm (Bi-Weekly)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1667772043035-1FW2735DVXA5ALCIV6QA/IMG-8338.PNG"
  },
  {
    "title": "Culinary Arts Club",
    "description": "Mission: Our mission is to help students understand the diversity and \npreparation of foods worldwide. Members will explore a new culture and its \nculinary specialties during each meeting. They will learn the background of \nthe meals and have the opportunity to cook them themselves. Members will be \nintroduced to basic cooking skills they can use for the rest of their \nlives. Our club is perfect for students to get creative with their food and \neat outside of their comfort zone. Occasionally, members can participate in \nworking with the GCC Helping Hands Club to assemble meals that will be \ndonated to organizations helping citizens in need. \n\nPresident: Rita Akopyan\n\nrakopya958@student.glendale.edu\n\nVice President: Elen Mkhitaryan\n\nemkhita002@student.glendale.edu\n\nAdvisor: Andrew Feldman\n\nafeldman@glendale.edu\n\nMeeting Date & Time: Wednesday at 4:00pm (Once a Month)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1695246977497-O6TN58DOLYLIQKPUWH2A/Screenshot+2023-09-20+at+2.56.00+PM.png"
  },
  {
    "title": "Dental Training Club",
    "description": "Mission: It is Dental Training Club’s purpose to provide a hands-on \nexperience to the members who have an interest in the field of dentistry, \nthose who want to pursue a career in dentistry, as well as those who are \ncurious about the duties of a dentist. The club will provide dental \ninstruments and oral models which will be used by the club members to \npractice oral procedures, learn about the purpose of each instrument, get \nfamiliar with the terminology and work together on dental related projects. \nSecond, the club will also use online simulations to educate members on \nmore complicated procedures which will not be possible to perform outside \nof a dental practice/hospitals. The Dental Training Club will also offer \nvolunteer/shadow opportunities to members who are interested to learn more \nabout the field from local dentists.  \n\n** Disclaimer: Currently listed below are last semester’s executive and \nadvisory, the upcoming semester’s are pending. **\n\nPresident: Anto Fazilian \n\nantofazilian@gmail.com\n\nVice President: Arman Koharian \n\narmankoharian@yahoo.com\n\nAdvisor: Ali Jabalameli \n\najabalam@glendale.edu",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1677876421563-HMETF2KSS43BQ2ANFW1D/dental_training_club_logo.jpg"
  },
  {
    "title": "Disability Advocacy Initiative",
    "description": "Mission Statement: To provide a safe environment to facilitate self \nadvocacy while empowering students with disabilities and allies. \n\nPresident: Kylo Tenuta  \n\nktenuta3704@student.glendale.edu \n\nVice President: Miguel Molina  \n\nmmolina5627@student.glendale.edu \n\nClub Advisor: Janelle Delgado \n\njdelgado@glendale.edu "
  },
  {
    "title": "Economics Club",
    "description": "Mission Statement: Economics Club is a club that is dedicated to the \nfostering and discussion of economic topics. Our club's goals consist of \neducating members on relevant and developing economic trends and news. We \nwould like to fulfill the interests of students who have a curiosity for \nthis branch of information and want to incorporate open discussion amongst \nmembers at meetings. Ultimately, we would like to provide students with a \nspace where they can meet like minded students with aspirations of \nattaining a high level of knowledge and professionalism regarding the field \nof economics. Open to students of all majors.\n\nPresident: Matthew Tahmasian \n\nmtahmas585@student.glendale.edu \n\nVice President: Shahryar Khezri \n\nskhezri841@student.glendale.edu \n\nClub Advisor: Michael Gale \n\nmgale@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1696647620824-RGXEXTVQJLB96DKU479W/unnamed.jpg"
  },
  {
    "title": "ESL Club",
    "description": "1. Providing an opportunity to apply the knowledge gained in the class in \npractice.\n\n2. Providing students with all kinds of necessary assistance.\n\n3. Organizing intellectual and entertainment events to improve the quality \nof English language proficiency.\n\nPresident: Mariana Martinova\n\nmmartin5820@student.glendale.edu\n\nVice President: Armine Geghamyan\n\nagegham166@student.glendale.edu\n\nAdvisor: Zohara Kaye\n\nzkaye@student.glendale.edu",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1710803901653-ZZEGDWZ5F4TFK9RZO6XL/IMG_3307.jpg"
  },
  {
    "title": "Fashion Club",
    "description": "Mission: The Fashion Club’s mission is to educate and spread knowledge to \nstudents relating to the fashion industry. Students will learn about what \ngoes on behind the scenes in the industry and potential career paths and \nwill gain insight into the opportunities fashion schools can offer. We aim \nto bring together like-minded individuals who share an interest in all \nthings fashion, with a focus ranging from its history and upbringing to \nmarketing, designing, merchandising, traditional and cultural attire, and \nmany more fields! Members will learn new skills and gain relevant \nexperience in different areas of fashion all while artistically expanding \nand expressing themselves through their unique stylistic choices. We as a \ncommunity intend to establish a supportive, gender-neutral, inclusive, and \nengaging environment for those who simply have a passion or are open to \nbroadening their scope of knowledge pertaining to fashion. With the help of \nour members, we can all leave a positive impact on the evolving fashion \nindustry by promoting sustainability and ethical fashion practices to \nbetter our environment as a whole!\n\nPresident: Karon Gharibian\n\nkgharib276@student.glendale.edu\n\nVice President: Tina Abramyan\n\ntabramy637@student.glendale.edu\n\nAdvisor: Murray Stach\n\nmstach@glendale.edu\n\nMeeting Time: Wednesdays at 2:00pm (Once a month)\n\nSocial Media: @gccfashionclub",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1693264633992-NFSN42UHU31Z8PQIJ2QU/copy_of_fc_logo_1+%281%29.png"
  },
  {
    "title": "Feminist Society",
    "description": "Mission: Feminist Society is committed to advocating for gender equality \nand intersectional social justice on campus and beyond. Our goal is to \nacknowledge the different forms of oppression individuals face while \nproviding resources for everyone to navigate through the world safely and \nsuccessfully. We believe the fight against oppression is a mantle we must \nall carry to make this world a better place for us (and future generations) \nto live. As Bell Hooks said, \"Feminism is for everyone.\" We invite everyone \nwho believes in equality and equity to join us.\n\nPresident: Alena Kunjumon\n\nVice President: Katherine Juarez\n\nAdvisor: Megan Torrey-Payne\n\nmtorreypayne@glendale.edu\n\nMeeting Date & Time: Thursdays at 12:30pm (Bi-Weekly)\n\nContact Email: feministsocietyatgcc@gmail.com. ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1663798832324-GT3UB386SB2WS40H11Q5/Feminist-Society-Logo-Color.jpg"
  },
  {
    "title": "Filipino American Student Association",
    "description": "Mission Statement: The Filipino American Student Association (FASA, \nhereafter referred to as the Association) will: -foster cultural \nempowerment and social responsibility by creating opportunities to examine, \nunderstand, and celebrate the diverse experiences of Filipino Americans; \n-build and strengthen relationships with Filipino and Filipino American \norganizations and leaders on and off campus; -represent the Association in \na highly professional manner in all matters pertaining to its activities on \nand off campus. \n\nPresident: Pauline Cipriano \n\npcipria272@student.glendale.edu \n\nVice President: Keilani Pak \n\nkpak012@student.glendale.edu \n\nClub Advisor: Michael Dulay  \n\nmdulay@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1709407484890-1A7JY3PQN6NSG49C8HNY/FASA+Round+Logo.png"
  },
  {
    "title": "GCC Aviators",
    "description": "Mission Statement: The purpose of the GCC Aviators is to cultivate \nrelationships and develop the interests of active and aspiring pilots and \naviation enthusiasts. We build deep camaraderie with our network of current \nGlendale Community College students, alumni, and faculty to facilitate the \naviation goals and dreams of our members through actively participating and \nbuilding relationships in the aviation community - people of all \nbackgrounds and experience levels - in a fun and exciting environment. \n\nClub President: Anthony Vasquez \n\navasque990@student.glendale.edu \n\nVice President: Mikaela Harris  \n\nmharris830@student.glendale.edu \n\nClub Advisor: Rob Newman  \n\nhnewman@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1635202209766-CQW0JXNPFM6G5EW7B7WA/GCC+Aviator+Logo.png"
  },
  {
    "title": "GCC Ceramics Club",
    "description": "Mission: To provide a more equitable and enriching experience for ceramic \nstudents and club members at GCC\n\nPresident: Oberon Marashlian\n\nomarash239@student.glendale.edu\n\nVice President: Faith Cho\n\nFcho762@student.Glendale.edu\n\nAdvisor: Gerardo Monterrubio\n\ngmonterrubio@glendale.edu\n\nMeeting Date & Time: Pending\n\nMeeting Location: Pending",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1693266300630-JXUU660ZWJN9YE8XUK0H/gcccc_logo_20230802+%281%29.png"
  },
  {
    "title": "GCC Engineering Club",
    "description": "Mission Statement: To cultivate a dynamic and inclusive community that \nfuels innovation, fosters excellence, and nurtures the growth of future \nengineers. To providing a platform where aspiring engineers can \ncollaborate, learn, and thrive, both academically and professionally. \nThrough a combination of hands-on projects, educational events, and \nnetworking opportunities. \n\n \n\nClub President: Hagop Azarian \n\nhazaria997@student.glendale.edu \n\nVice President: Levon Markosyan \n\nlmarkos719@student.glendale.edu \n\nClub Advisor: Luis Labra Bahena \n\nllabrabahena@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1615243916498-YQSG0IYGF05DSBXAFFK9/engineer-clipart-engineer-symbol-9.png"
  },
  {
    "title": "GCC Film Club",
    "description": "Mission Statement: A place where people passionate about film can come \ntogether, and anyone is welcome.  \n\nPresident: Alexa Khosrovian \n\nakhosro895@student.glendale.edu \n\nVice President: Greendey Salazar \n\ngsalaza296@student.glendale.edu \n\nClub Advisor: Geri Ulrey \n\ngulrey@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1664566338353-WM8ECDQE7GT8EMGYOR34/film_club_icon.jpg"
  },
  {
    "title": "GCC Gardening Club",
    "description": "Mission: We would like to create a self-sustaining community-grown garden \non the GCC campus. First, we need to get the garden back in working order, \nbut once that is done we will set upon the larger effort of creating a \nspace for collaboration, mindfulness, and learning via the cultivation of \nplants that naturally thrive in our Mediterranean climate. Starting with a \nvegetable garden we want to create a place where community members can have \nthe opportunity to get a sense of what gardening is like, in a hands-on \nway, using fully organic techniques with no pesticides and no manufactured \nchemicals. A few other goals of this project:\n\n-Experimentation of different horticultural techniques.\n\n-Using local resources to create our own fertilizer and compost.\n\n-Producing food to be shared with the community.\n\n-Highlighting eco-friendly local businesses (plant nurseries, etc.)\n\n-Collaborate with other clubs.\n\n-Learning about our native plants. -Sharing knowledge gained through the \nprocess. \n\nA few other goals of this club:\n\n-Experimentation of different horticultural techniques.\n\n-Using local resources to create our own fertilizer and compost.\n\n-Producing food to be shared with the community.\n\n-Highlighting eco-friendly local businesses (plant nurseries, etc.)\n\n-Collaborate with other clubs.\n\n-Learning about our native plants.\n\n-Sharing knowledge gained through the process. \n\nPresident: Jeremy Welch\n\njwelch394@student.glendale.edu\n\nVice President: Evan Hoyle  \n\nehoyle309@student.glendale.edu\n\nAdvisor: Michael Reed\n\nmreed@glendale.edu\n\nMeeting Date & Time: Saturday 10am-1pm ( First and third Saturday of the \nmonth)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1695237413059-EWC596GV1372JBFBD0WU/ca+poppy.jpg"
  },
  {
    "title": "GCC Health and Fitness Club",
    "description": "Mission: During these hard times after the pandemic, many of us are \nstruggling to stay in shape resulting in a toll on our mental and physical \nhealth. Our club hopes to advise like-minded individuals on how they can \nreach their health and fitness goals. We will make weekly reports for our \nfitness plans and meet Wednesdays at 4pm to discuss them. We will organize \noutdoor fitness activities including but not limited to hiking, tennis, \nswimming, soccer, at least once a month. Our goal is to bring our community \ntogether while doing the things that we love! We have over 2 years of \ncoaching experience and are always looking for new people to workout and \nhave a good time with! \n\nPresident: Jessica Yazichyan\n\njyazich524@student.glendale.edu\n\nVice President: Anna Baghdasaryan\n\n abaghda401@student.glendale.edu\n\nAdvisor: Arevhat Nazaryan\n\nanazarya@glendale.edu\n\nMeeting Date & Time: to be announced",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1678404954772-PSFL9IYCNP0XZG04ML3Z/4E31E773-3D1B-42D0-B378-0C769EF36413.jpg"
  },
  {
    "title": "GCC Investing Club",
    "description": "Mission Statement: The goal of my club is to educate people on stocks and \nhow to invest properly while also focusing on aspects of day trading \noptions. Learning to invest and how the stock market operates at an early \nage could set a person up for a successful future and teaches the \nimportance and value of investing which can ultimately lead a person to \nsuccess. The club will focus on different areas of stocks including \ntrading, but the main goal is to teach people skills and how to invest. \n\nPresident: Edward Pogosian \n\nepogosi004@student.Glendale.edu\n\nVice President: Hassan Jouni \n\nhjouni007@student.glendale.edu \n\nClub Advisor: Gerardo Zarate\n\nGzarate@glendale.edu  "
  },
  {
    "title": "GCC Model United Nations",
    "description": "Mission: Glendale Community College Model United Nations (GCCMUN) through \nresearch, discussions and cooperative debate, aims to develop plausible \nsolutions to the economic, political, cultural and ethnic concerns of our \ncontemporary world, as well as familiarize participants with the operations \nand legislative processes of the United Nations.\n\nPresident: Kylie Sears\n\nksears495@student.glendale.edu\n\nVice Presidents: Susan Akopian\n\nsakopia042@student.glendale.edu\n\nAdvisor: Shada Sbeta\n\nssbeta@glendale.edu\n\nMeeting Date & Time: Once a month on Tuesdays, 12:20pm-1:30pm. (Bi-weekly)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1667772660524-KD7HDKVXCW89ALX4L9ZQ/IMG-8344.PNG"
  },
  {
    "title": "GCC Red Cross Club",
    "description": "Mission: Guided by the fundamental principles of the American Red Cross and \nits mission to prevent and alleviate human suffering in the face of \nemergencies by mobilizing the power of volunteers and the generosity of \ndonors, the Glendale Community College Red Cross Club will learn, practice \nand exemplify humanitarian values through mission-related service projects.\n\nPresident: Sarah Shahbandaryan \n\nsshahba482@student.glendale.edu\n\nVice President: Shushanik Shakhbandaryan\n\nSshakhb952@student.glendale.edu\n\nAdvisor: Gagik Labadzhyan\n\nglabadzh@glendale.edu\n\nMeeting Date & Time: Fridays at 3:00pm\n\nInstagram: @gccredcrossclub",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1615853182387-JY22ZC2RMKFRK48R01FW/Capture.JPG"
  },
  {
    "title": "GCC Soccer Association",
    "description": "Mission: Our mission is to create more opportunities for GCC students to \nlearn and play soccer casually and competitively. We aim to play an active \nrole in teaching students the fundamentals of soccer while also allowing \nthem to unleash their creativity in organizing various tournaments and \nclub-related events. For those who are competitive, we will offer learning \nopportunities to help them advance in their careers. For more casual \nplayers, we will host events that create a fun and welcoming environment at \nGCC.\n\nPresident: Yervand Ovchiyan\n\nyovchiy311@student.glendale.edu\n\nVice President: Arvin Mosesian  \n\namosesi107@student.glendale.edu\n\nAdvisor: Laura Matsumoto\n\nlauram@glendale.edu\n\nMeeting Date & Time: Pending",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1707944645921-42RNXPACH1D37DPUAELE/gccsa.jpg"
  },
  {
    "title": "GCC Student-Parent Club",
    "description": "Mission Statement: The mission of the GCC Student Parent Club is to \nadvocate for student-parent needs, wishes, and well-being and to make the \neducational journey more accessible, productive, fun, and supportive. The \nGCC Student-Parent Club also exists to help students be role models to \ninspire their children to prioritize higher education and to create bright \nfutures for families. \n\nPresident: Shushik Hovakimyan \n\nshushan.hovakimyan.shushik@gmail.com \n\nVice President: Armenuhi Snkhchyan \n\nasnkhch415@student.glendale.edu \n\nClub Advisor: Aarin Edwards \n\naedwards@glendale.edu \n\nInstagram: @gccspc",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1665101771891-CIK9VOSZOSMNDZC7HDYH/0f1494e9-609c-46fe-b7b5-f6551c2849bb.jpeg"
  },
  {
    "title": "Glendale Art Society",
    "description": "Mission: To provide a safe space for the GCC student body to share and \nfoster interest in various forms of art. GCC Art Club will provide \nopportunities for budding artists alike to learn and grow in their \nindividual art lives as well as with their community. The group will \nprovide a space to create and share art no matter their ability or talent \nand provide a space for healthy critical feedback to improve students’ \nskills for an art career. \n\nPresident: Sosie Berg\n\nsberg653@student.glendale.edu\n\nVice President: Emujin Chinzog\n\nechinozo015@student.glendale.edu\n\nAdvisor: Bea Vallez\n\nbvallz@glendale.edu\n\nMeeting Date & Time: Monday at 11:30pm (Bi-Weekly)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1698859749097-IYKAFXSZ7ZPXY7OCTI32/thumbnail_final+art+society+logo+-02.png"
  },
  {
    "title": "GCC Pre-Surgery Society",
    "description": "Mission: Even for those of us who live for a surgical career, not knowing \nwhat to specialize in or how to get a head start can seem like such \ndaunting hurdles. The Pre-Surgery Society aims to help aspiring surgeons \nturn both of these challenges into unique opportunities by presenting our \nresearch on specialties and advancements in the field, demystifying and \nproviding preparation for the med school process, providing a bridge \nbetween students and hands-on pre-med experience, inviting our members to \nguest presentations from our community’s top specialists; and sharing the \npre-med skills that those same physicians know lead to success. At our \nmeetings, we strive to share our love for surgery by ensuring that every \nmember walks away having learned and understood an exciting topic. Even \nthough medicine is full of big words and complicated ideas, our mission is \nto simplify the path to surgery—a tenet we uphold everywhere possible. \nMembership is open to all students from any major in order to advance their \ninterest and education in surgery.\n\nPresident: Markus Leonardo Batres\n\nmleonar557@student.glendale.edu\n\nVice President: Jessica Hovhannisyan  \n\njhovh012@student.glendale.edu\n\nAdvisor: Robert Mardirosian\n\nrobertm@glendale.edu\n\nMeeting Date & Time: First Friday of the month at 1pm. Please contact the \nclub for the Zoom link.",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1707944221991-R1FEFXK33F3K1H63ZNUS/society_logo_v2+%281%29.png"
  },
  {
    "title": "Global Medical Training",
    "description": "Mission: The purpose of Global Medical Training is to provide medical and \ndental services to underprivileged communities around the world. Our \nphilosophy is that everyone should have access to the most basic medical \nneeds. Therefore, this mission is achieved by encouraging students to \nparticipate in our annual medical mission trips. During these trips, the \nstudents work with local doctors to provide healthcare for patients. In \naddition to the clinical experience, students also gain knowledge about \npreventative medicine and learn how to build doctor-patient relationships. \nOur goal is to help as many patients possible in addition to our student's \nexperiencing personal growth and a love for medicine.\n\nPresident: Amee Petrossian\n\napetros773@student.glendale.edu\n\nVice President: Jane Zargaryan\n\njzargar044@student.glendale.edu \n\nAdvisor: Abraham Baca\n\nabaca@glendale.edu\n\nMeeting Date & Time: Once a month on Tuesdays, 2pm.\n\nInstagram: @gccgmt",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1615853392738-QN1NT4XR0OTUW2Y93K71/logo.jpg"
  },
  {
    "title": "GROUNDED",
    "description": "Mission: Grounded is a student club with the purpose of creating a \ncommunity where people feel inspired and welcomed to GROW into better \nversions of themselves. Grounded will provide students with a community and \nactivities to improve their mental, physical, and emotional health. Our \nclub will host activities that promote a healthy and happy lifestyle. We \nwill emphasize the importance and benefits of taking time outside. We will \ndiscuss several outdoor activities that we might engage in to improve our \nhealth and quality of life. For instance, we will discuss our distinct \nexperiences leading active outdoor lifestyles. Our purpose of this club is \nto create a community of well GROUNDED individuals who appreciate the great \noutdoors and seek to grow as individuals. \n\nPresident: Paola Duron\n\npduron583@student.glendale.edu\n\nVice President: Aleksandra Martinez\n\namartin888@student.glendale.edu\n\nAdvisor: Kelly Andrade\n\nkandrade@glendale.edu\n\nMeeting Date & Time: Wednesdays at 1:00pm (Bi-Weekly)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694713892348-NLEL6YG6CCN3RG1J8LRN/Grounded+.png"
  },
  {
    "title": "HealthCare Pathways",
    "description": "Mission: HealthCare Pathways is a fun and welcoming one-stop-shop to stay \nconnected to those who are pursuing healthcare positions, whether that be \nan EMT or a surgeon, and to discover the resources necessary to fully step \ninto the medical field—while also getting a jump start on connections and \nexperience. College is already a complicated place to be, so by simplifying \nthe process of finding the resources to sign up for certification classes, \ninternships, volunteering, shadowing positions, and more, we can find \ngreater success early in our careers!\n\nPresident: Jane Zargaryan\n\njzargar044@student.glendale.edu\n\nVice President: Alex Petrossian\n\napetros282@student.glendale.edu\n\nAdvisor: Ali Jabalameli\n\nalijabalameli@glendale.edu"
  },
  {
    "title": "Helping Hands",
    "description": "Mission: Our mission is to help the unhoused community in Los Angeles \nCounty through advocacy, fundraising, volunteering, monetary assistance, \nand food donation.\n\nPresident: Emily Gharakhanian\n\negharak678@student.glendale.edu\n\nVice President: Maria Muradyan\n\nmmurady124@student.glendale.edu\n\nAdvisor: Robyn Fishman\n\nrfishman@glendale.edu\n\nMeeting Date & Time: Thursdays from 12:30pm (Bi-Weekly)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694111298230-7Y4I07OOF92VN85YXK1X/thumbnail_image_50442497.jpg"
  },
  {
    "title": "International Students Club",
    "description": "Mission: To advocate for international students’ interests and promote \ninternational perspectives by fostering interaction and communication \nbetween international students, the college, and the community. \n\nPresident: Armando Olivo\n\naolivot009@student.glendale.edu\n\nVice President: Abdelrahman Nouh\n\nANOUH928@student.glendale.edu\n\nAdvisor: Armenuhi Andzu\n\naandzu@glendale.edu\n\nMeeting Date & Time: Monday at 12:45pm ( Once a month)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1667771677306-DXS0SM5FAPUSDRMGV5XK/Screen+Shot+2022-11-06+at+1.53.48+PM.png"
  },
  {
    "title": "Japanese Cultural Association",
    "description": "Mission: To promote Japanese Culture, history, and social issues. To foster \ninteraction and communication from a Japanese perspective between Japanese \nstudents and the GCC community. To offer Japanese students the support to \nstudy and pursue their career choices. \n\nPresident: Ryota Akamatsu \n\nrakamat057@student.glendale.edu\n\nVice President: Mizuki Sumitomo \n\nMsumito838@student.glendale.edu\n\nAdvisor: Murray Stach \n\nmstach@glendale.edu",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1676365591652-HXBUD8K5JIIKJDWUPJ27/image01298.jpeg+%281%29+%28002%29.jpg"
  },
  {
    "title": "LSAT and Logical Thinking Advancement Association",
    "description": "Mission: The club's mission is to help advance the logical thinking skills \nof individuals who join the club, thus setting them up for success in their \nfield of study, regardless of their field of study. The club will, however, \nhave a slight focus on the things covered on the LSAT, including extra \ninformation on how to succeed on the test itself.\n\nPresident: Hayk Avetisyan\n\nhavetis158@student.glendale.edu\n\nVice President: Erik Ohanyan \n\neohanya801@student.glendale.edu\n\nAdvisor: Sanja Morris\n\nsanjam@glendale.edu\n\nMeeting time & Date: Tuesdays at 3:00pm (Once a Month)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1693265261349-6QMRJ7KI0155PJLJSXTC/screenshot_20230729_134603+%281%29.png"
  },
  {
    "title": "Orgullo Latiné",
    "description": "Mission: Our missions is to provide a safe environment for the students \nthat are in gcc that identify as Latino/ Latinx. We incorporate this with \nthe services and community of support emotional and educational resources \nfor the students. We are interested in making the population of Latinos in \ngcc welcome and encouraging them with the strength to continue in their \ncareer journey. We also strive to be a huge support system for all kinds of \nLatinos. \n\nPresident: Mitzel Martinez\n\nmmartin2432@student.glendale.edu\n\nVice President: Isabel Casem\n\nicasem637@student.glendale.edu\n\nAdvisor: Anthony Garcia\n\nanothonyg@glendale.edu\n\nMeeting Date & Time: to be announced",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694642235951-73D0N9XVW5D1DQT2YBE8/Orgullo+Latine+.jpeg.jpg"
  },
  {
    "title": "Photography Club",
    "description": "Mission: The main objective is to bring students together that are \ninterested in photography and develop new interest in photography as a \ndiscipline. Expand their knowledge of photography and introduce digital art \nthrough photography. The club will help those interested in photography new \nor Intermediate, to take better photos and learn the art of photography. \nEveryone who has an interest in learning about photography is welcome to \njoin. This will also be an incredibly safe place for anyone and everyone, \nso no one should be afraid to join this great club about photography. \n\nPresident: Eduardo Garcia\n\negarcia429@student.glendale.edu\n\nVice President: Astghik Kalashyan  \n\nakalash205@student.glendale.edu\n\nAdvisor: David Yamamoto\n\ndavidy@glendale.edu\n\nMeeting Date & Time: to be announced\n\nInstagram: @photographyclub.gcc",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1679450622528-MAYU35YEASDGRLKW9POD/NewLogoPhotoClubFinalVersion.jpg"
  },
  {
    "title": "Plasthetics Club",
    "description": "Mission: The Plasthetics (Plastics and Aesthetics) Club is a community \nfilled with students who share the same passion and ambition for the \naesthetics industry. Our goal is to expand the knowledge of all things \nrelated to plastic surgery and cosmetic procedures to GCC’s future \naesthetic enthusiasts. From plastic surgery to dermal fillers and various \nlasers, our philosophy is to broaden our understanding of aesthetic \nprocedures and create a fun and safe environment where individuals can \nbuild relationships with like-minded peers, all interested in pursuing \ncareers in the rapidly growing aesthetic industry. With guest speakers such \nas board-certified plastic surgeons and all kinds of cosmetic nurses, we \nhope to find you in our club, deepening your interests in the world of \naesthetics.  \n\nPresident: Anabella Bagian\n\nabagian738@student.glendale.edu\n\nVice President: Milen Ghukasyan\n\nmghukas109@student.glendale.edu\n\nAdvisor: Vanessa Abcede\n\nvabcede@glendale.edu",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1677876298227-OVBWM3M5DGPVYX1EV7SG/PLASTHETICS+CLUB.jpg"
  },
  {
    "title": "Politics Club",
    "description": "Mission: We provide a safe place for people to share their political \nopinions in a respectful and productive way. We plan to touch upon topics \nsuch as foreign policy and how that can affect people in society. We will \ndiscuss how politics has changed over history as well. \n\nPresident: Sara Taleb\n\nstaleb945@student.glendale.edu\n\nVice President: Meri Sarkisian\n\nmsarkis090@student.glendale.edu\n\nAdvisor: Daniel Kono\n\ndkono@glendale.edu\n\nMeeting Date & Time: Tuesday at 12:15pm (Bi-Weekly)"
  },
  {
    "title": "Pre-Dental Club",
    "description": "Mission: The Pre-Dental Club aims to inspire the pre-dental students of GCC \nby offering them the insightful advice needed for them to make the right \nchoices, starting in their undergraduate studies all the way to dental \nschool. We will arrange possible shadowing opportunities for pre-dental \nstudents to get in some volunteer work and even match them to a job in a \ndental office. There will be networking events with dental school \noutreaches, as well as dentists who have already graduated from dental \nschool, for the best upfront advice. As students of a community college, \nthe GCC pre-dental club will be a space where students can ask questions \nregarding career decisions for the right direction in their personal and \neducational journey. \n\nPresident: Sophia Karapetyan\n\nskarape487@student.glendale.edu\n\nVice President: Predita Nowrouzi\n\npnowrou103@student.glendale.edu\n\nAdvisor: Gagik Labadzhyan\n\nglabadzh@glendale.edu\n\nMeeting Date & Time: Once a month on Wednesday, 12:30pm\n\nInstagram: @gccpredental",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1693256970323-UM82VWSG1HW5YD88LXS3/predental_club_logo_.jpg"
  },
  {
    "title": "Pre-Law Club",
    "description": "Mission: Have an environment of individuals who are interested and \nenthusiastic about law. Have various activities or events Guest Speakers, \nMock Trials, Conversations about current legal events, LSAT prep, etc. Be \nfree and open. Stress the importance of speaking and sharing ideas.\n\nPresident: Arya Ghaneh\n\narya.ghaneh@icloud.com\n\nVice President: Vahe Zobian\n\nvzobian171@student.glendale.edu\n\nAdvisor: Cameron Hastings\n\nhastings@glendale.edu\n\nMeeting Date & Time: to be announced",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1664212836805-TFJRNDV372D7HZWLQPXX/Pre-Law+Logo+1.png"
  },
  {
    "title": "Pre-Med Club",
    "description": "Mission: The purpose of the Pre-Med Club is to foster a safe and fun \nenvironment where individuals can learn about the different aspects and \nfields within medicine and healthcare. We aim to broaden the understanding, \nappreciation and interest within GCC’s future proponents of medicine. Our \nphilosophy is to not only learn about new med-related topics, but to be \nable to create a space where like minded peers can come together to foster \ntheir love and interest in pursuing a career in medicine. We hope you will \njoin us to deepen your interests in medicine!\n\n** Disclaimer: Currently listed below are last semester’s executive and \nadvisory, the upcoming semester’s are pending. **\n\nPresident: Talar Chadarevian\n\ntchadar963@student.glendale.edu\n\nVice President: Sonia Alexani-Babaroudi\n\nsalexan116@student.glendale.edu\n\nAdvisor: Vincent Ferguson\n\nvferguson@glendale.edu\n\nMeeting Date & Time: Mondays, 6:00 pm\n\nMeeting Location: to be announced\n\nInstagram: @gcc.premed.club",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1633980690185-RCEQXAET5BZCLEVAT2BK/Screen+Shot+2021-10-11+at+12.31.23+PM.png"
  },
  {
    "title": "Pre-Nursing Club",
    "description": "Mission Statement: The Pre-Nursing Peer Mentorship Club is a place where \nstudents will be able to learn and network with one another along their \njourneys as pre-nursing majors. By creating an atmosphere that is engaging \nand inviting, students will be able to learn about networking opportunities \nand form connections with other peers and professionals in the field of \nhealthcare. The club's goal is to promote methods of Peer Mentorship, such \nas tutoring, sharing work/volunteering/internship opportunities, and \nnursing school prep/informational sessions. We will be working with the SNA \nto host events and meetings. \n\nPresident: Ani Agakhanyan \n\naagakha674@student.glendale.edu \n\nVice President: Pauline Zargarian \n\npzargar671@student.glendale.edu \n\nClub Advisor: Heather Tran \n\nhtran@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1696007192902-HPSI3JRO3RTUZOIDEXRG/unnamed.jpg"
  },
  {
    "title": "Pre-Pharm",
    "description": "Mission: The Pre-Pharm club stands for informing students about the \npharmaceutical/pharmacy field and the possible endeavorers that they can \nexperience. The primary goal of this club is to allow students to explore \nthe field and gain knowledge while seeking new opportunities. \n\nPresident: Shantae Noravian\n\nsnoravi326@student.glendale.edu\n\nVice President: Serli Khajehsari\n\nskhajeh609@student.glendale.edu\n\nAdvisor: Randa Reslan\n\nrreslan@glendale.edu\n\nMeeting Date & Time: Pending",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1695676954021-6YS6UM90FV8U0ADLEKTA/Pre-Pharm%2BLogo-1.jpg"
  },
  {
    "title": "Psychology Club",
    "description": "Mission: The Psychology club's mission is to create a community of students \nthat want to expand their knowledge of psychology. Club members of all \nmajors are welcome and will have opportunities to attend and/or present on \npsychological topics of interest, learn about careers in psychology and \nattend and participate in psychology-related field trips and campus events. \nPsychology is a science and aimed at understanding the brain and behavior. \nIt is a large field with many branches. Whatever your interest, social \npsychology, positive psychology, developmental, personality, abnormal, or \nbiological psychology, there is a place for you in the psychology club. \n\nPresident: Lianna Davoudi Chigani\n\nldavoud374@student.glendale.edu\n\nVice President: Adriana Kirokosyan\n\nakirako709@student.glendaled.edu\n\nAdvisor: Michelle Calderwood\n\nmcalderwood@glendale.edu\n\nMeeting Date & Time: Every 2nd & 4th Thursday of the month at 12:30pm.",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694715249407-NSEAAINZ9J1ZI80BQ5MV/club_logo.png"
  },
  {
    "title": "ROBOTICS CLUB",
    "description": "Mission: The Robotics Club stands for providing a platform for students at \nGCC to engage in robotics-related activities. The club's goals are to \nfoster a community of individuals interested in robotics and technology. It \nseeks to provide an opportunity for students to improve their coding and \nrobotics abilities. The Robotics Club caters to the interests and \nrequirements of students who are interested in robotics and technology. \nStudents who have a keen interest in coding can find a space to apply their \nskills in practical projects related to robotics. Get ready for an \naction-packed day! Witness thrilling robot fights, enjoy an open-air movie \nnight under the stars, and experience the excitement of piloting drones \nthrough an obstacle course. Food trucks and vendors will keep you \nenergized. It's an unforgettable event filled with technology, \nentertainment, and delicious treats!\n\nPresident: Rafayel Keshishyan\n\nrkeshis863@student.glendale.edu \n\nVice President: Hayk Pogosyan\n\nhpogosy519@student.glendale.edu\n\nAdvisor: Sevada Avakian\n\nsavakian@glendale.edu\n\nMeeting Date & Time: Pending\n\nMeeting Location: Pending",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1693263678213-ZRE2E411IKXJFG241QSH/inkedrobotthumbsupcartoonlogodesignvector_1_clipdropenhance_clipdropenhance12+%282%29.jpg"
  },
  {
    "title": "SACNAS",
    "description": "Mission: SACNAS is an inclusive organization dedicated to fostering the \nsuccess of Chicanos/Hispanics and Native Americans, from college students \nto professionals, in attaining advanced degrees, careers, and positions of \nleadership in STEM.\n\nPresident: Katherine Juarez\n\nkjuarez282@student.glendale.edu\n\nVice President: Janet Reyes\n\njreyes912@student.glendale.edu\n\nAdvisor: Richard Cortes\n\nrcortes@glendale.edu\n\nMeeting Date & Time: Fridays at 10am",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1708451212645-FTGXP13G8JETCY0VE16S/Screenshot+2024-02-20+at+9.46.35+AM.png"
  },
  {
    "title": "SAGA (Sexuality and Gender Alliance)",
    "description": "Mission: The Sexuality and Gender Alliance (SAGA) purpose is to provide a \nplace of inclusivity, respect, and understanding for all people of \ndifferent genders and sexualities. We will promote advocacy and recognition \nof the LGBTQIA+ community and provide a non-judgmental, safe place for \neverybody to strive in their happiest and truest selves. This club will \neducate and cultivate a culture within the club that increases acceptance \nand opposes homophobia and transphobia. We welcome everyone, both LGBTQIA+, \nand allies, to be a part of this club, create connections, and learn about \none another.\n\nPresident: Lemont McDowell   \n\nlmcdowe421@student.glendale.edu \n\nVice President: Alena Kunjunmon\n\nakunjum193@student.glendale.edu\n\nAdvisor: Hoover Zariani\n\nhzariani@glendale.edu\n\nMeeting Date & Time:\n\n9/15 - 12:23-2:30 pm - Friday  \n\n9/29 - 12:23-2:30 pm - Friday  \n\n10/12th &13th - 12:23-2:30pm Thursday & Friday  \n\n11/16 - 12:23-2:30pm – Thursday \n\n 12/8 -12:23-2:30pm - Friday ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694717047848-YUOXDY19FDS3KKPZO5PC/SAGA.png"
  },
  {
    "title": "Scholars Program",
    "description": "Mission: Since 1986, the Scholars Program of Glendale Community College \n(referred to as “The Program” or “Scholars”) seeks to provide an optimal \ncollege experience among its students, which it carries out through three \nmain elements: academics, service, and collegiality. First, the Program \noffers an enhanced, enriched lower-division and general-education \ncurriculum of Honors courses. Second, the Program aspires to strengthen the \ncharacter of each student through community service and various efforts to \nhelp others. Third, the Program fosters social support, cooperation, \ncollaboration, bonding, and friendship. As such, the Program strives to \nguide and prepare students for transfer to a college or university and to \nhelp them achieve success in their future careers. Scholar students pursue \nthese goals with an understanding that being a valuable part of an \norganization entails the ability to be resourceful, plan systematically, \nproceed vigorously, follow-through carefully, focus on the greater good, \nand communicate consistently and precisely. Through these three elements, \nScholars thus intends to foster qualities of well-rounded individuals and \ncitizens as they rise toward their true potential. \n\nPresident: Elizabeth Baburyan\n\nebabury388@student.glendale.edu\n\nVice President: Gohar Boroyan\n\ngboroya987@student.glendale.edu\n\nAdvisor: Michael Harnett\n\nscholars@glendale.edu\n\nInstagram: @gcc_scholars\n\n",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1615852739002-E6WU6DTG78PY52SEGF3W/Scholars.JPG"
  },
  {
    "title": "Student Nursing Association",
    "description": "Mission: Our mission as the Student Nurses Association of Glendale \nCommunity College is to promote and encourage the participation of nursing \nstudents, prospective nursing students, and those interested in the \nhealthcare industry through the nurse’s perspective into collaborative \nrelationships with health-related organizations and provide programs \nrepresentative of the interests of members.\n\nPresident: Nicole Cummings\n\nncummin552@student.glendale.edu\n\nVice President: Tyler Garrison\n\ntrgarrison1213@gmail.com\n\nAdvisor: Karima Esmail\n\nkesmail@glendale.edu\n\nMeeting Date & Time: Mondays at 1:00 pm (Bi-Weekly)",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1668020409470-SGOZQA46ES53XSVOBIUC/sna.jpg"
  },
  {
    "title": "Students4Transfer",
    "description": "Mission: Students4Transfer (S4T) is a dedicated community of students \nunited by the shared commitment to empower fellow learners in their pursuit \nof higher education. We aim to inform, guide, and support students on their \njourney to transfer to institutions of their choice, facilitating access to \neducational opportunities. Through a dynamic platform of educational \ninitiatives, transfer guidance, and community engagement, we strive to \nbreak down barriers and provide valuable resources that enhance \nunderstanding of the transfer process, application strategies, and academic \npreparation. At S4T, we believe that every student deserves the chance to \nachieve their educational goals, and we work tirelessly to make this vision \na reality by fostering a supportive and inclusive environment for all \nmembers. Together, we empower dreams and transform futures. \n\nPresident: Amaras Issagholian\n\nAissagh885@student.glendale.edu\n\nVice President: Dino Azadians  \n\ndazadia831@student.glendale.edu\n\nAdvisor: Kevin Meza\n\nkmeza@glendale.edu\n\nMeeting Date & Time: Fridays from 2pm to 5pm\n\nMeeting Location: Learning Commons\n\nInstagram: @vaquerosgaming",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694647131637-NCYNJO63KO1QYYVLA4Q8/students4transfer_logo.jpg.png"
  },
  {
    "title": "Students for Sustainability Club",
    "description": "Mission: In the sustainability club, the cabinet plans to inspire GCC \nstudents to get involved with the significance of sustainability. By \npromoting sustainability, we hope to spread a more eco-friendly mindset \namong students. We are going to quickly multitude ways of educating fellow \nstudents about the pressing issues that are occurring worldwide. Through \nlive meetings, social media, hands-on activities, volunteer opportunities, \nand more sources of promoting sustainable practices, we hope to ensure a \nsafe space for students who want to advocate for the wellness of the \nplanet. The sustainability club wants to initiate the attitude to protect \nour Planet Earth. \n\nPresident: Sophia Karapetyan\n\nskarape487@student.glendale.edu  \n\nVice President: Sona Torosyan\n\nmirzak502@student.glendale.edu\n\nAdvisor: Rachel Ridgeway\n\nrridgeway@gmail.com\n\nMeeting Date & Time: to be announced",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1693250519639-G30CFWDSGWMVAYMXDQIE/logo+%281%29.jpg"
  },
  {
    "title": "System Impacted Intellectuals",
    "description": "Mission: To create a safe space for formerly incarcerated and \nsystem-impacted students. We meet biweekly during the fall/spring semester \nto support each other and organize events that bring awareness about \nindividuals who are disproportionately impacted, directly or indirectly, by \nthe criminal justice system.\n\nPresident: Tommy Lopez \n\nTlopez805@student.glendale.edu\n\nVice President: Mauricio Gonzalez\n\nmgozal829@student.glendale.edu\n\nAdvisor: Michelle Calderwood \n\nmcalderwood@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1676364960095-TQRSRV2A3X44QOXNFL2O/1+%28002%29.png"
  },
  {
    "title": "The Giving Hearts Collective",
    "description": "Mission Statement: The Giving Hearts Collective is dedicated to positively \nimpacting the lives of the homeless by providing essential goods, \ngroceries, and sanitary supplies whilst fostering compassion. Our mission \nis to address the immediate needs of those experiencing homelessness and \ncreate a sense of belonging and support within our community. \n\nPresident: Ania Khachikian \n\nakhachi947@student.glendale.edu \n\nVice President: Piunik Issakhani \n\npissakh952@student.glendale.edu \n\nClub Advisor: Randa Reslan  \n\nrreslan@glendale.edu "
  },
  {
    "title": "Theatre Guild",
    "description": "Mission: Glendale Community College’s Theatre Guild has one main purpose, \nto unify all aspects of theatre arts and support them as much as possible. \nWhether interested in stage management, stagecraft, hair and makeup, \nlighting and design, acting, or any other aspect of theatre, students will \nfind themselves in a strong, supportive, and encouraging environment. We \naim to bring in as many new students as we can into our theatre community \nto allow the beauty and power of theatre to prosper at Glendale Community \nCollege and in turn, give the many facets of theatre equitable support. \nIndividuals with and without theatre experience are welcome to join; this \nis a safe space for all. Welcome to the Theatre Guild.\n\nPresident: Emily Torres\n\netorres039@student.glendale.edu\n\nVice President: Emma Rodriguez\n\nemmanicrodriguez@gmail.com\n\nAdvisor: Melody Gunter\n\nmelodyg@glendale.edu\n\nMeeting Date & Time: Thursdays at 12:40pm (Bi-Weekly)"
  },
  {
    "title": "Vaqueros Gaming & Esports",
    "description": "Mission: To bring together different types of students to engage with each \nother through gaming. Our club's goal is to shed light on the esports scene \nand build a competitive team to compete with other colleges. We are \nfulfilling a need to socialize and build a community on campus of gamers.\n\nPresident: Ian Genova\n\nigenova437@student.glendale.edu\n\nVice President: IsaeArreola\n\niarreol120@student.glendale.edu\n\nAdvisor: Mikel Rodriguez\n\nmikelr@glendale.edu\n\nMeeting Date & Time: Pending\n\nMeeting Location: Pending\n\nInstagram: @vaquerosesports",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1633099800513-WKGF97SVPJY8OTP5TAC3/vaquerosesports_logo.png"
  },
  {
    "title": "Veteran's Club",
    "description": "Mission Statement: Our mission is to honor, support, and empower veterans \nfrom all branches of the military, fostering a sense of belonging, \ncamaraderie, and purpose among those who have served our nation. By \ninstilling these values into our club of support and wellness, education \nand transition assistance, giving back to GCC and the surrounding \ncommunity. We are able to stand united in our commitment to ensuring that \nno veteran feels alone or unsupported in their journey beyond the military. \nTogether, we honor the past, empower the present, and embrace the future \nfor all who have served. \n\nPresident: Ramiro Acosta \n\nracosta892@student.glendale.edu \n\nVice President: Christian Mandarino \n\ncmandar486@student.glendale.edu\n\nClub Advisor: Leonardo Perez \n\nlperez@glendale.edu ",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1707944503218-198HYFQYJ5WMGQ9DVSRX/club_logo.jpeg.jpg"
  },
  {
    "title": "V.O.I.C.E.S",
    "description": "Mission: VOICES stands for Voices Organizing Immigrant Communities for \nEducational Success. Like our name states, we want to help immigrant \ncommunities through their college years. We also aim to raise awareness of \nthe difficulties immigrant communities face not only in their educational \npursuit but also in their daily lives.\n\nPresident: Lilian Hernandez  \n\nLhernan750@student.glendale.edu\n\nVice President: Tatevik Mirzakhanyan  \n\ntmirzak258@student.glendale.edu\n\nAdvisor: Anthony Garcia\n\nMeeting Date & Time: Thursdays at 12:00pm (weekly)\n\nInstagram: @v.o.i.c.e.s_gcc",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/569ebaa542f552b94cb936f8/1694717294704-VQ9GJ21Q4ZVP4R3YTWGG/voices_logo_23+%281%29.png"
  },
  {
    "title": "UNICEF Club",
    "description": "Mission: UNICEF club aims to advocate for and educate others on UNICEF’s \nmission of supporting disadvantaged children around the world by giving \nthem equal opportunities for health, education, protection, and inclusion. \nThrough community service and fundraising opportunities, members will spend \ntheir time actively helping UNICEF’s cause in empowering children in \nunderserved communities.\n\nPresident: Josephine Alvandi\n\njalvand695@student.glendale.edu\n\nVice President: Emelia Davoodi Masihi\n\nEdavood350@student.glendale.edu\n\nAdvisor: Sangita Dube\n\nsdube@glendale.edu"
  },
  {
    "title": "GCC Chess Club",
    "description": "The GCC Chess Club aims to provide a place for Chess players and people \ninterested in Chess to meet, play, study, or watch the game. Anybody is \nwelcome to come by, even if not to play Chess. We also welcome most \ntabletop games like card games like blackjack, poker, or durak.\n\nPresident: Ryan Gump\n\nrgump330@student.glendale.edu\n\nVice President: Alex Aghanian\n\nAaghani205@student.glendale.edu\n\nAdvisor: Gagik Labadzhyan\n\nglabadzh@glendale.edu"
  }
]

